In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn

In [4]:
np.random.seed(101)

In [5]:
df=pd.DataFrame(randn(4,4),['A','B','C',"D"],['c1','c2','c3','c4'])

In [6]:
df

         c1        c2        c3        c4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [7]:
df['c2']#access the column

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
Name: c2, dtype: float64

In [8]:
df.c2

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
Name: c2, dtype: float64

In [9]:
#access multiple columns
df[['c2','c4']]# pass list of columns as attribute

         c2        c4
A  0.628133  0.503826
B -0.319318  0.605965
C  0.740122 -0.589001
D -0.758872  0.955057

In [10]:
#adding new column 
df['new']=df['c2'] +df['c4']

In [11]:
df

         c1        c2        c3        c4       new
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184

In [12]:
#drop a column
#df.drop('new')#default axis=0
#so to delete it axis=1
df.drop('new',axis=1)

         c1        c2        c3        c4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [13]:
df#new is still existing in dataframe
#to delete it permanenetly inplace=True

         c1        c2        c3        c4       new
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184

In [14]:
df.drop('new',axis=1,inplace=True)

In [15]:
df# new deleted permanently

         c1        c2        c3        c4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [16]:
#drop a row
df.drop('D')# no need to mention axis =0 as its default
#if inplace=True then it will be permanent delete

         c1        c2        c3        c4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001

In [17]:
df.shape#4,4 this is where rows are on 0 axis & col's on 1

(4, 4)

In [18]:
df

         c1        c2        c3        c4
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [19]:
#access rows
"""2 ways
df.loc['rowname']- label base acess
df.iloc[2]- numerical base access
"""
df.loc['C']#label access

c1   -2.018168
c2    0.740122
c3    0.528813
c4   -0.589001
Name: C, dtype: float64

In [20]:
df.iloc[2]#numeric index access

c1   -2.018168
c2    0.740122
c3    0.528813
c4   -0.589001
Name: C, dtype: float64

In [21]:
#access subsets of rows&col's
df.loc['D','c3']

-0.9332372163009188

In [22]:
#multiple rows &col's
df.loc[['A','C'],['c4','c3']]

         c4        c3
A  0.503826  0.907969
C -0.589001  0.528813

In [23]:
var=pd.read_excel("Stressdataset.xlsx")

In [24]:
var

   s.no    name  age  traditional educational approaches   Stress of exam
0     1  puneet   25                                    1               1

In [25]:
import numpy as np

In [26]:
from numpy import random

In [27]:
np.random.seed(10)

In [28]:
dj=pd.DataFrame(random.randn(2,2))

In [29]:
dj

          0         1
0  1.331587  0.715279
1 -1.545400 -0.008384

In [30]:
d=pd.DataFrame(randn(2,2),columns=(['id','price']),index=('a','b'))

In [31]:
d

         id     price
a  0.621336 -0.720086
b  0.265512  0.108549

In [32]:
#conditionally Fetching data
d>0#returns true if satisfies condition else false

     id  price
a  True  False
b  True   True

In [33]:
newdf=d<0

In [34]:
newdf

      id  price
a  False   True
b  False  False

In [35]:
d[newdf]

   id     price
a NaN -0.720086
b NaN       NaN

In [36]:
d

         id     price
a  0.621336 -0.720086
b  0.265512  0.108549

In [37]:
d[d<0] #direct way to pass condition

   id     price
a NaN -0.720086
b NaN       NaN

In [38]:
d['price']>0 #condition selecting to a particular column.

a    False
b     True
Name: price, dtype: bool

In [39]:
d[d['price']>0]#will return only rows which have true values.

         id     price
b  0.265512  0.108549

In [40]:
#to do more analysis lets create a big dataframe
more_data=pd.DataFrame(randn(7,5),['R1','R2','R3','R4','R5','R6','R7'],['c1','c2','c3','c4','c5',])

In [41]:
more_data

          c1        c2        c3        c4        c5
R1  0.004291 -0.174600  0.433026  1.203037 -0.965066
R2  1.028274  0.228630  0.445138 -1.136602  0.135137
R3  1.484537 -1.079805 -1.977728 -1.743372  0.266070
R4  2.384967  1.123691  1.672622  0.099149  1.397996
R5 -0.271248  0.613204 -0.267317 -0.549309  0.132708
R6 -0.476142  1.308473  0.195013  0.400210 -0.337632
R7  1.256472 -0.731970  0.660232 -0.350872 -0.939433

In [42]:
more_data[more_data['c2']<0]#returns c2 whole rows where value <0

          c1        c2        c3        c4        c5
R1  0.004291 -0.174600  0.433026  1.203037 -0.965066
R3  1.484537 -1.079805 -1.977728 -1.743372  0.266070
R7  1.256472 -0.731970  0.660232 -0.350872 -0.939433

In [43]:
more_data[more_data['c5']<0][['c5','c1']]

          c5        c1
R1 -0.965066  0.004291
R6 -0.337632 -0.476142
R7 -0.939433  1.256472

In [44]:
#multiple conditions on dataframe
#and,or work on single row values not on series.
#SO replaced by &, |-pipe symbol
#multiple_condition=more_data[(more_data['c1']<0)and(more_data['c2']<0)] error
multiple_condition=more_data[(more_data['c1']<0)& (more_data['c2']<0)]

In [45]:
multiple_condition

Empty DataFrame
Columns: [c1, c2, c3, c4, c5]
Index: []

In [46]:
selected_col=more_data[(more_data['c1']<0)& (more_data['c2']<0)][['c1','c2']]
#conditional data & selected column.
#we can break this statement into multiple small statements.

In [47]:
selected_col

Empty DataFrame
Columns: [c1, c2]
Index: []

In [48]:
#reset row index
reset=more_data.reset_index() 
#adds new col of indexes & doesnt update/delete previous index.
#old index will become column of dataframe
#to do so pass inplace=True in reset function.

In [49]:
reset

  index        c1        c2        c3        c4        c5
0    R1  0.004291 -0.174600  0.433026  1.203037 -0.965066
1    R2  1.028274  0.228630  0.445138 -1.136602  0.135137
2    R3  1.484537 -1.079805 -1.977728 -1.743372  0.266070
3    R4  2.384967  1.123691  1.672622  0.099149  1.397996
4    R5 -0.271248  0.613204 -0.267317 -0.549309  0.132708
5    R6 -0.476142  1.308473  0.195013  0.400210 -0.337632
6    R7  1.256472 -0.731970  0.660232 -0.350872 -0.939433

In [50]:
#original data not impacted.
more_data

          c1        c2        c3        c4        c5
R1  0.004291 -0.174600  0.433026  1.203037 -0.965066
R2  1.028274  0.228630  0.445138 -1.136602  0.135137
R3  1.484537 -1.079805 -1.977728 -1.743372  0.266070
R4  2.384967  1.123691  1.672622  0.099149  1.397996
R5 -0.271248  0.613204 -0.267317 -0.549309  0.132708
R6 -0.476142  1.308473  0.195013  0.400210 -0.337632
R7  1.256472 -0.731970  0.660232 -0.350872 -0.939433

In [51]:
#adding new column
new_col='jerry,berry,merry,tom,ceasor,kitty,milly'.split(',')

In [52]:
new_col

['jerry', 'berry', 'merry', 'tom', 'ceasor', 'kitty', 'milly']

In [53]:
more_data['names']= new_col

In [54]:
more_data

          c1        c2        c3        c4        c5   names
R1  0.004291 -0.174600  0.433026  1.203037 -0.965066   jerry
R2  1.028274  0.228630  0.445138 -1.136602  0.135137   berry
R3  1.484537 -1.079805 -1.977728 -1.743372  0.266070   merry
R4  2.384967  1.123691  1.672622  0.099149  1.397996     tom
R5 -0.271248  0.613204 -0.267317 -0.549309  0.132708  ceasor
R6 -0.476142  1.308473  0.195013  0.400210 -0.337632   kitty
R7  1.256472 -0.731970  0.660232 -0.350872 -0.939433   milly

In [55]:
#setting names col as index
more_data.set_index('names')
#this function will override the previous index unlike reset()

              c1        c2        c3        c4        c5
names
jerry   0.004291 -0.174600  0.433026  1.203037 -0.965066
berry   1.028274  0.228630  0.445138 -1.136602  0.135137
merry   1.484537 -1.079805 -1.977728 -1.743372  0.266070
tom     2.384967  1.123691  1.672622  0.099149  1.397996
ceasor -0.271248  0.613204 -0.267317 -0.549309  0.132708
kitty  -0.476142  1.308473  0.195013  0.400210 -0.337632
milly   1.256472 -0.731970  0.660232 -0.350872 -0.939433

In [56]:
more_data

          c1        c2        c3        c4        c5   names
R1  0.004291 -0.174600  0.433026  1.203037 -0.965066   jerry
R2  1.028274  0.228630  0.445138 -1.136602  0.135137   berry
R3  1.484537 -1.079805 -1.977728 -1.743372  0.266070   merry
R4  2.384967  1.123691  1.672622  0.099149  1.397996     tom
R5 -0.271248  0.613204 -0.267317 -0.549309  0.132708  ceasor
R6 -0.476142  1.308473  0.195013  0.400210 -0.337632   kitty
R7  1.256472 -0.731970  0.660232 -0.350872 -0.939433   milly

In [57]:
#multiIndex- we can have multiple indexes.
l1=['sectionA','sectionA','sectionA','sectionB','sectionB']
l2=['g1','g2',"g3",'g1','g2']
combined_index=list(zip(l1,l2))

In [58]:
combined_index

[('sectionA', 'g1'),
 ('sectionA', 'g2'),
 ('sectionA', 'g3'),
 ('sectionB', 'g1'),
 ('sectionB', 'g2')]

In [59]:
multi_index=pd.MultiIndex.from_tuples(combined_index)

In [60]:
multi_index

MultiIndex([('sectionA', 'g1'),
            ('sectionA', 'g2'),
            ('sectionA', 'g3'),
            ('sectionB', 'g1'),
            ('sectionB', 'g2')],
           )

In [61]:
multi_index_df=pd.DataFrame(randn(5,3),multi_index)

In [62]:
multi_index_df

                    0         1         2
sectionA g1 -0.489337 -0.804591 -0.212698
         g2 -0.339140  0.312170  0.565153
         g3 -0.147420 -0.025905  0.289094
sectionB g1 -0.539879  0.708160  0.842225
         g2  0.203581  2.394704  0.917459

In [63]:
multi_index_df.loc['sectionA']#accessing outter index

           0         1         2
g1 -0.489337 -0.804591 -0.212698
g2 -0.339140  0.312170  0.565153
g3 -0.147420 -0.025905  0.289094

In [64]:
multi_index_df.loc['sectionA'].loc['g2']#accessing inner index

0   -0.339140
1    0.312170
2    0.565153
Name: g2, dtype: float64

In [65]:
multi_index_df.iloc[0]#returns first row

0   -0.489337
1   -0.804591
2   -0.212698
Name: (sectionA, g1), dtype: float64

In [66]:
multi_index_df.iloc[1:4]#range of index

                    0         1         2
sectionA g2 -0.339140  0.312170  0.565153
         g3 -0.147420 -0.025905  0.289094
sectionB g1 -0.539879  0.708160  0.842225

In [67]:
multi_index_df.index.names=['Section','Group']

In [68]:
multi_index_df

                       0         1         2
Section  Group
sectionA g1    -0.489337 -0.804591 -0.212698
         g2    -0.339140  0.312170  0.565153
         g3    -0.147420 -0.025905  0.289094
sectionB g1    -0.539879  0.708160  0.842225
         g2     0.203581  2.394704  0.917459

In [69]:
multi_index_df.loc['sectionA'].loc['g3'][0]#accessing particular values

-0.14742025772701986

In [70]:
multi_index_df

                       0         1         2
Section  Group
sectionA g1    -0.489337 -0.804591 -0.212698
         g2    -0.339140  0.312170  0.565153
         g3    -0.147420 -0.025905  0.289094
sectionB g1    -0.539879  0.708160  0.842225
         g2     0.203581  2.394704  0.917459

In [71]:
multi_index_df.xs('g1',level='Group')#crosssection used to index data
#fetches mentioned index from all outer indexes

                 0         1         2
Section
sectionA -0.489337 -0.804591 -0.212698
sectionB -0.539879  0.708160  0.842225

<h3>Handling Missing Values</h3>

In [72]:
d={'sepal_length':[np.nan,0.4,np.nan,0.8,np.nan],
   'petal_length':[0.4,np.nan,np.nan,0.6,0.2],
   'sepal_width':[1.3,0.1,0.9,0.7,0.2],
   'petal_width':[0.7,0.1,0.3,0.6,np.nan]
}

In [73]:
d

{'sepal_length': [nan, 0.4, nan, 0.8, nan],
 'petal_length': [0.4, nan, nan, 0.6, 0.2],
 'sepal_width': [1.3, 0.1, 0.9, 0.7, 0.2],
 'petal_width': [0.7, 0.1, 0.3, 0.6, nan]}

In [74]:
df=pd.DataFrame(d)

In [75]:
df

   sepal_length  petal_length  sepal_width  petal_width
0           NaN           0.4          1.3          0.7
1           0.4           NaN          0.1          0.1
2           NaN           NaN          0.9          0.3
3           0.8           0.6          0.7          0.6
4           NaN           0.2          0.2          NaN

In [76]:
df.dropna()
#this method will drop all the rows which have missing values
#bydefault action will be on rows since axis=0

   sepal_length  petal_length  sepal_width  petal_width
3           0.8           0.6          0.7          0.6

In [77]:
#if we want to perform dropna() on col's set axis=1
#will delete all the col's containing missing values
df.dropna(axis=1)

   sepal_width
0          1.3
1          0.1
2          0.9
3          0.7
4          0.2

In [78]:
df

   sepal_length  petal_length  sepal_width  petal_width
0           NaN           0.4          1.3          0.7
1           0.4           NaN          0.1          0.1
2           NaN           NaN          0.9          0.3
3           0.8           0.6          0.7          0.6
4           NaN           0.2          0.2          NaN

In [79]:
#we can define limit on removing rows containing missing values.
df.dropna(thresh=3)
#will display the rows having minimun 3 non missing values

   sepal_length  petal_length  sepal_width  petal_width
0           NaN           0.4          1.3          0.7
1           0.4           NaN          0.1          0.1
3           0.8           0.6          0.7          0.6

In [80]:
df.dropna(axis=1,thresh=3)
#will keep the col's having minimum 3 non missing values

   petal_length  sepal_width  petal_width
0           0.4          1.3          0.7
1           NaN          0.1          0.1
2           NaN          0.9          0.3
3           0.6          0.7          0.6
4           0.2          0.2          NaN

In [81]:
#fill the missing values
df.fillna(value='fill')
#value attribute can be set to anything that you want to fill

  sepal_length petal_length  sepal_width petal_width
0         fill          0.4          1.3         0.7
1          0.4         fill          0.1         0.1
2         fill         fill          0.9         0.3
3          0.8          0.6          0.7         0.6
4         fill          0.2          0.2        fill

In [82]:
#generally we fill the mean of a column
mean=df['sepal_width'].mean()

In [83]:
mean

0.64

In [84]:
df.fillna(value=mean)
#setting the missing values to mean

   sepal_length  petal_length  sepal_width  petal_width
0          0.64          0.40          1.3         0.70
1          0.40          0.64          0.1         0.10
2          0.64          0.64          0.9         0.30
3          0.80          0.60          0.7         0.60
4          0.64          0.20          0.2         0.64

<h3>Group By</h3>

In [85]:
d={'student':['jerry','jerry','jerry','tom','tom','tom'],
   'subject':['english','science','maths','english','science','maths'],
   'marks':[22,30,40,48,42,35]
  }

In [86]:
df=pd.DataFrame(d)

In [87]:
df

  student  subject  marks
0   jerry  english     22
1   jerry  science     30
2   jerry    maths     40
3     tom  english     48
4     tom  science     42
5     tom    maths     35

In [88]:
groub_byStudent=df.groupby('student')

In [89]:
groub_byStudent.mean()

             marks
student
jerry    30.666667
tom      41.666667

In [90]:
groub_byStudent.std()

            marks
student
jerry    9.018500
tom      6.506407

In [91]:
groub_byStudent.sum()

         marks
student
jerry       92
tom        125

In [92]:
groub_byStudent['subject'].count()#returns count of subjects

student
jerry    3
tom      3
Name: subject, dtype: int64

In [93]:
groub_byStudent.min()#returns minimum value for each student

         subject  marks
student
jerry    english     22
tom      english     35

In [94]:
groub_byStudent['subject'].max()#returns max marks

student
jerry    science
tom      science
Name: subject, dtype: object

In [95]:
df.groupby('student').describe()
#describes various aggregate functions on data

        marks
        count       mean       std   min   25%   50%   75%   max
student
jerry     3.0  30.666667  9.018500  22.0  26.0  30.0  35.0  40.0
tom       3.0  41.666667  6.506407  35.0  38.5  42.0  45.0  48.0

<h3>Merging Joining & Concatenating DataFrames</h3>

In [96]:
d1={'c1':[1,2,3],
   'c2':[10,11,12]}
d2={'c1':[4,5,6],
   'c2':[13,14,15]}
d3={'c1':[7,8],
   'c2':[16,17]}

In [97]:
df1=pd.DataFrame(d1)

In [98]:
df1

   c1  c2
0   1  10
1   2  11
2   3  12

In [99]:
df2=pd.DataFrame(d2)

In [100]:
df2

   c1  c2
0   4  13
1   5  14
2   6  15

In [101]:
df3=pd.DataFrame(d3)

In [102]:
df3

   c1  c2
0   7  16
1   8  17

In [103]:
pd.concat([df1,df2,df3])#concatenating 3 dataframes
#concatenation glues the dataframes together
#concatenation row wise

   c1  c2
0   1  10
1   2  11
2   3  12
0   4  13
1   5  14
2   6  15
0   7  16
1   8  17

In [104]:
pd.concat([df1,df2,df3],axis=1)
#concat column wise

   c1  c2  c1  c2   c1    c2
0   1  10   4  13  7.0  16.0
1   2  11   5  14  8.0  17.0
2   3  12   6  15  NaN   NaN

<h3>Merging</h3>

In [105]:
#pd.merge(dataframe1,dataframe2, how="type of merging",on='common column')
#how- is similar to join in sql i.e inner,left,right,full

In [106]:
l={'s.no':[1,2,4],
   'name':['ramesh','suresh','jerry']
}
left=pd.DataFrame(l)

In [107]:
left

   s.no    name
0     1  ramesh
1     2  suresh
2     4   jerry

In [108]:
r={'s.no':[1,2,3],
   'marks':[20,30,40]
}
right=pd.DataFrame(r)

In [109]:
right

   s.no  marks
0     1     20
1     2     30
2     3     40

In [110]:
pd.merge(left,right, how='inner', on='s.no')
#inner returns the common s.no in dataframes

   s.no    name  marks
0     1  ramesh     20
1     2  suresh     30

In [111]:
pd.merge(left,right, how='left', on='s.no')
#returns all rows from left & matching records from right dataframe.

   s.no    name  marks
0     1  ramesh   20.0
1     2  suresh   30.0
2     4   jerry    NaN

In [112]:
pd.merge(left,right, how='right', on='s.no')
#returns all rows from right & matching from left

   s.no    name  marks
0     1  ramesh     20
1     2  suresh     30
2     3     NaN     40

In [113]:
pd.merge(left,right, how='outer', on='s.no')
#returns all if there is match either in left or right

   s.no    name  marks
0     1  ramesh   20.0
1     2  suresh   30.0
2     4   jerry    NaN
3     3     NaN   40.0

In [114]:
d={'s.no':[1,2,4],
   'name':['ramesh','suresh','jerry']
}
df1=pd.DataFrame(d)

In [115]:
df1

   s.no    name
0     1  ramesh
1     2  suresh
2     4   jerry

In [116]:
d2={'marks':[10,20,40],
   
}
df2=pd.DataFrame(d2)

In [117]:
df2

   marks
0     10
1     20
2     40

In [118]:
df1.join(df2)#joins the columns

   s.no    name  marks
0     1  ramesh     10
1     2  suresh     20
2     4   jerry     40

In [119]:
df1.join(df2, how='right')

   s.no    name  marks
0     1  ramesh     10
1     2  suresh     20
2     4   jerry     40

<h3>Pandas OPerations</h3>

In [120]:
s={'USN':[101,102,103],
   'Name':['Ramesh','Suresh','Ramesh'],
   'Mobile':[66,77,66]
}
df=pd.DataFrame(s)

In [121]:
df.head(2)

   USN    Name  Mobile
0  101  Ramesh      66
1  102  Suresh      77

In [122]:
#finding Unique value in dataframe
df['Name'].unique()#returns array of unique values in column Name

array(['Ramesh', 'Suresh'], dtype=object)

In [123]:
df['Name'].nunique()#returns number of unique values in column Name

2

In [124]:
df['Name'].value_counts()#returns count of all values in name column

Ramesh    2
Suresh    1
Name: Name, dtype: int64

<h3>apply()</h3>

In [125]:
#we can apply a customised function on dataframe using apply
def multiplyby2(x):
    return x*2
#multiplyby2(20)
df['USN'].apply(multiplyby2)

0    202
1    204
2    206
Name: USN, dtype: int64

In [126]:
df['USN'].apply(lambda x:x/2)

0    50.5
1    51.0
2    51.5
Name: USN, dtype: float64

In [127]:
df.columns#returns list of column names

Index(['USN', 'Name', 'Mobile'], dtype='object')

In [128]:
df.index #gives information of index

RangeIndex(start=0, stop=3, step=1)

In [129]:
#sorting & Ordering Dataframe
df.sort_values('Mobile')#sorted dataframe by column mobile

   USN    Name  Mobile
0  101  Ramesh      66
2  103  Ramesh      66
1  102  Suresh      77

In [130]:
df.isnull()#checks for null values

     USN   Name  Mobile
0  False  False   False
1  False  False   False
2  False  False   False

In [131]:
df.pivot_table(values='Mobile',index=['USN','Name'],columns=['c'])

      Mobile    USN
Name      77  102.0
USN       66  101.0
c         66  103.0

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [133]:
df.describe

<bound method NDFrame.describe of    USN    Name  Mobile
0  101  Ramesh      66
1  102  Suresh      77
2  103  Ramesh      66>

<h3>Reading Data from different sources</h3>